<?php
// Задача 1
$k = -10; $z = 2;

function x ($k,$z){
    if ($k<1){
        $x = $k*($z**3);
    }if ($k>=1){
        $x = $z*($z+1);
    }return $x;
}

$y = (log(1+x($k,$z)**2)+cos(x($k,$z)+1))**exp($k*x($k,$z));

echo 'Задача 1 ответ: y =  '.$y.'(бесконечность)'.'<br>';

// Задача 2
$k1 = 1; $z1 = 1;

function x1 ($z1){
    if ($z1>0){
        $x1 = 1/(($z1**2)+(2*$z1));
    }if ($z1<=0){
        $x1 = 1-($z1**3);
    }return $x1;
}

$y1 = (2*exp(-3*x1($z1)))-(4*(x1($z1)**2))/(log(abs(x1($z1))))+x1($z1);

if ((log(abs(x1($z1))))+x1($z1) != 0){
    echo '<br>'.'Задача 2 ответ: y =  '.$y1.'<br>';
}else {
    echo 'НА НОЛЬ ДЕЛИТЬ НЕЛЬЗЯ!!!!';
}
?>