<?php

echo "Первый пример " . "<br>";
$k = -10;
$z = 2;

//$k = 1;
//$z = 1;

if ($k<1){
    $x = $k*$z**3;
}else{
    $x = $z*($z+1);
}

$y = (log(1+$x**2) + cos($x+1))**(M_E**($k*$x));
echo $y . "<br>";

echo "Второй пример" . "<br>";
$k = 1;
$z = 1;
$err = false;

if ($z>0){
    if ($z**2 + 2*$z === 0){
        echo  "Ошибка, не правильные значения. На 0 делить нельзя." . "<br>";
        $err = true;
    }else{
        $x = 1/($z**2 + 2*$z);
    }

}else{
    $x = 1- $z**3;
}

if ($err === false){
    echo (2*M_E**(-3*$x) - 4*$x**2)/(log(abs($x))+$x);
}