<?php
$a = 1+2+3;

echo $a."<br>";

echo 1+2+3;

$b = 10;

$c = 2;

echo "<br>".$b+$c."<br>";

echo $b-$c."<br>";

echo $b*$c."<br>";

echo $b/$c."<br>";

$d = 10;

$e = 5;

$result = $d+$e;

echo $result."<br>";

$a1 = 1;

$b1 = 2;

$c1 = 3;

echo $a1+$b1+$c1."<br>";

$a2 = 10;

$b2 = 5;

$c2 = $a2-$b2;

$d2 = 7;

$result2 = $c2+$d2;

echo $result2."<br>";

echo 'Задача 7 - ответ: 20 <br>';

echo 'Задача 8 - ответ: 23 <br>';

echo 'Задача 9 - ответ: 6 <br>';

echo 'Задача 10 - ответ: 9 <br>';

echo 'Задача 11 - ответ: 8 <br>';

echo 'Задача 12 - ответ: 8 <br>';

echo 'Задача 13 - ответ: 25 <br>';

echo 'Задача 14 - ответ: 13 <br>';

echo 'Задача 15 - ответ: 36 <br>';

echo 'Задача 16 - ответ: 4 <br>';

echo 'Задача 17 - ответ: 4 <br>';

echo 'Задача 18 - ответ: 4 <br>';

$a3 = 1.5;

$b3 = 0.75;

echo $a3+$b3."<br>";

$a4 = -100;

echo $a4."<br>";

echo -$a4."<br>";

$a5 = 10;

$b5 = 3;

echo $a5%$b5."<br>";

echo 2**10;

echo 'Задача 24 - ответ: 24 <br>';

echo 'Задача 25 - ответ: 216 <br>';

echo 'Задача 26 - ответ: 48 <br>';

echo 'Задача 27 - ответ: 24 <br>';

echo 'Задача 28 - ответ: 72 <br>';
?>
