app/View/Composers/BlogViewComposer.php

select * from `categories`
---
    public function compose(View $view)
    {
        $view->with("popularPosts", Post::getPopularPosts());
        $view->with("featuredPosts", Post::getFeaturedPosts());
        $view->with("recentPosts", Post::getRecentPosts());
        $view->with("categories", Category::all());
        $view->with("weather", $this->weatherService);