app/Http/Controllers/CommentController.php

insert into `comments` (`text`, `user_id`, `post_id`, `slug`, `updated_at`, `created_at`) values ('fgfgfgfg', 8, '5', 'fgfgfgfg', '2022-05-25 14:00:15', '2022-05-25 14:00:15')
---
    public function store(StoreCommentRequest $request)
    {
        $comment = new Comment();
        $comment->text = $request->get("message");
        $comment->user_id = Auth::user()->id;
        $comment->post_id = $request->get("post_id");
        $comment->save();