app/Http/Controllers/HomeController.php

select * from `posts` limit 2 offset 0
select count(*) as aggregate from `posts`
select * from `posts` order by `views` desc limit 3
select * from `posts` where `is_recommended` = 1 limit 3
select * from `posts` order by `created_at` desc limit 4
select * from `categories`
---
    public function index(WeatherServiceContract $weather)
    {
        $posts = Post::paginate(2);
        $popularPosts = Post::orderBy("views", "desc")->take(3)->get();
        $featuredPosts = Post::where("is_recommended", 1)->take(3)->get();
        $recentPosts = Post::orderBy("created_at", "desc")->take(4)->get();
        $categories = Category::all();

select * from `posts` where `slug` = 'new-post-6' limit 1
---
    public function show(WeatherServiceContract $weather, $slug)
    {
        $post = Post::where("slug", $slug)->firstOrFail();

select * from `tags` where `slug` = 'teg-2' limit 1
select `posts`.*, `post_tag`.`tag_id` as `pivot_tag_id`, `post_tag`.`post_id` as `pivot_post_id` from `posts` inner join `post_tag` on `posts`.`id` = `post_tag`.`post_id` where `post_tag`.`tag_id` = 2 limit 2 offset 0
select count(*) as aggregate from `posts` inner join `post_tag` on `posts`.`id` = `post_tag`.`post_id` where `post_tag`.`tag_id` = 2
---
    public function tag(WeatherServiceContract $weather, $slug)
    {
        $tag = Tag::where("slug", $slug)->firstOrFail();
        $posts = $tag->posts()->paginate(2);

select * from `categories` where `slug` = 'liga-chempionov' limit 1
select * from `posts` where `posts`.`category_id` = 2 and `posts`.`category_id` is not null order by `created_at` desc limit 3 offset 0
select count(*) as aggregate from `posts` where `posts`.`category_id` = 2 and `posts`.`category_id` is not null
---
    public function category(WeatherServiceContract $weather, $slug)
    {
        $category = Category::where("slug", $slug)->firstOrFail();
        $posts = $category->posts()->paginate(2);