app/Models/Comment.php

    public function remove()
    {
        $this->delete();
---
delete from `comments` where `id` = 1