app/Models/Post.php

select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` = 1
---
    public function getTagsTitle()
    {
        return (!$this->tags->isEmpty())
            ? implode(', ', $this->tags->pluck('title')->all())

select * from `posts` where `posts`.`id` = '1' limit 1
select max(`id`) as aggregate from `posts` where `id` < 2
---
    public function hasPrevious()
    {
        return self::where("id", "<", $this->id)->max("id");

select * from `posts` where `posts`.`id` = '1' limit 1
select min(`id`) as aggregate from `posts` where `id` > 2
---
    public function getPrevious()
    {
        $postID = $this->hasPrevious();
        return self::find("$postID");

select * from `posts` where `posts`.`id` = '3' limit 1
select min(`id`) as aggregate from `posts` where `id` > 2
---
    public function hasNext()
    {
        return self::where("id", ">", $this->id)->min("id");

select * from `posts` where `posts`.`id` = '3' limit 1
---
    public function getNext()
    {
        $postID = $this->hasNext();
        return self::find("$postID");

select * from `posts`
---
    public function related()
    {
        return self::all()->except($this->id);

select * from `posts` order by `views` desc limit 3
---
    public static function getPopularPosts()
    {
        return self::orderBy("views", "desc")->take(3)->get();

select * from `posts` where `is_recommended` = 1 limit 3
---
    public static function getFeaturedPosts()
    {
        return self::where("is_recommended", 1)->take(3)->get();

select * from `posts` order by `created_at` desc limit 3
---
    public static function getRecentPosts()
    {
        return self::orderBy("created_at", "desc")->take(3)->get();