app/Models/Subscription.php

insert into `subscriptions` (`email`, `token`, `updated_at`, `created_at`) values ('root@mail.ru', 'CKsVrRO0MEv1ZUNG5ggAT0CFk59VBNZ22rFCs4svhUk1AyrIYTMGNbjeTH2ctw697Dc8mef1s6G8LjXCyv0OUJFOoqvG52W3dXHo', '2022-06-16 13:26:49', '2022-06-16 13:26:49')
---
    public function generateToken()
    {
        $this->token = Str::random(100);
        $this->save();