app/Models/User.php

    public static function getRated()
    {
        return self::orderBy("scores", "desc")->take(3)->get();
---
select * from `users` where `users`.`deleted_at` is null order by `scores` desc limit 3