app/Providers/AppServiceProvider.php

    public function boot()
    {
//        Gate::define('admin_panel', function(User $user) {
//            return $user->is_admin == 1;
//        });
//        view()->composer("pages._sidebar", function($view){
//            $view->with("popularPosts", Post::getPopularPosts());
//            $view->with("featuredPosts", Post::getFeaturedPosts());
//            $view->with("recentPosts", Post::getRecentPosts());
//            $view->with("categories", Category::all());
//        });
        view()->composer("admin._sidebar", function ($view) {
            $view->with("newCommentsCount", Comment::where("is_publish", 0)->count());
---
select count(*) as aggregate from `comments` where `is_publish` = 0