app/Providers/EventServiceProvider.php

    public function boot()
    {
        User::observe(UserObserver::class);
        Event::listen("postHasViewed", function ($post) {
            $post->increment("views");
---
update `posts` set `views` = `views` + 1, `posts`.`updated_at` = '2022-06-24 15:05:39' where `id` = 2