app/Http/Controllers/Admin/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Test', 'Test@test.by', '$2y$10$RwYkExMGIDPIT9shscLw8uHGPyknnJGoxrU0J57FMegKmYnD1S5jG', '2022-05-20 13:50:40', '2022-05-20 13:50:40')
---
    public function register(RegisterUserRequest $request)
    {
        User::create($request->validated());