app/Http/Controllers/Admin/CategoryController.php

select * from `categories` where `categories`.`id` = '5' limit 1
---
    public function update(UpdateCategoryRequest $request, Category $category)
    {
        $category = Category::find($category);