app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $categories = Category::paginate(3);
---
select * from `categories` limit 3 offset 0
select count(*) as aggregate from `categories`

    public function store(StoreCategoryRequest $request)
    {
        Category::create($request->validated());
---
insert into `categories` (`title`, `slug`, `updated_at`, `created_at`) values ('Категория добавленная', 'kategoriya-dobavlennaya', '2022-04-19 20:41:45', '2022-04-19 20:41:45')

    public function destroy(DestroyCategoryRequest $request, Category $category)
    {
        $category->delete();
---
delete from `categories` where `id` = 7