app/Http/Controllers/Admin/CommentController.php

select * from `comments`
---
    public function index()
    {
        $comments = Comment::all();

select * from `comments` where `comments`.`id` = '1' limit 1
---
    public function destroy($id)
    {
        Comment::find($id)->remove();