app/Http/Controllers/Admin/PostController.php

    public function index()
    {
        $posts = Post::paginate("3");
---
select * from `posts` limit 3 offset 0
select count(*) as aggregate from `posts`

    public function create()
    {
        return view("admin.posts.create", ["categories" => Category::all(), "tags" => Tag::all()]);
---
select * from `categories`
select * from `tags`

    public function edit(Post $post)
    {
        return view("admin.posts.edit", ["post" => $post, "categories" => Category::all(), "tags" => Tag::all()]);
---
select * from `post_tag` where `post_tag`.`post_id` = 1
select * from `posts`
select * from `categories`
select * from `tags`

    public function update(UpdatePostRequest $request, Post $post)
    {
        $post->update($request->validated());
        $post->tags()->sync($request->tags);
---
update `posts` set `description` = '<hr />\r\n<hr />\r\n<hr />\r\n<hr />\r\n<hr />\r\n<hr />\r\n<hr />\r\n<h2 style=\"font-style:italic\">И продлил с ним контракт до 2027 года</h2>', `is_publish` = 0, `is_recommended` = 0, `posts`.`updated_at` = '2022-06-17 14:03:47' where `id` = 1
insert into `post_tag` (`post_id`, `tag_id`) values (1, 2)