app/Http/Controllers/Admin/SubscribeController.php

    public function index()
    {
        $subs = Subscription::all();
---
select * from `subscriptions`