app/Http/Controllers/Admin/TagController.php

select * from `tags` limit 3 offset 0
select count(*) as aggregate from `tags`
---
    public function index()
    {
        $tags = Tag::paginate("3");

update `tags` set `title` = 'Тег 2 Новый', `tags`.`updated_at` = '2022-04-20 09:27:09' where `id` = 2
---
    public function update(UpdateTagRequest $request, Tag $tag)
    {
        $tag->update($request->validated());