app/Http/Controllers/Admin/UserController.php

select * from `users` where `users`.`deleted_at` is null limit 3 offset 6
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
---
    public function index()
    {
        $users = User::paginate("3");

insert into `users` (`name`, `email`, `password`, `avatar`, `updated_at`, `created_at`) values ('Test3', 'Test3@test.by', '$2y$10$t3HjfAqghJJeh1y/XEYcyeMOIfwzaCB/yNuIo5/taZm3uyXvF16eG', 'uploads/gMEjuC9Y8tXvO6um7Rv8XjyI4fVwZusduCFzvy8d.jpg', '2022-04-25 11:29:25', '2022-04-25 11:29:25')
---
    public function store(StoreUserRequest $request, User $user)
    {
        User::create($request->validated());

update `users` set `name` = 'User12323233454545', `users`.`updated_at` = '2022-04-22 18:39:58' where `id` = 2
---
    public function update(UpdateUserRequest $request, User $user)
    {
        $user->update($request->validated());

delete from `users` where `id` = 20
---
    public function destroy(User $user)
    {
        $user->delete();